RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc13x0/inc/hw_flash.h
// Field:     [8] CTRLENZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_CTRLENZ                                     0x00000100
#define FLASH_FBSTROBES_CTRLENZ_BITN                                         8
#define FLASH_FBSTROBES_CTRLENZ_M                                   0x00000100
#define FLASH_FBSTROBES_CTRLENZ_S                                            8

// Field:     [6] NOCOLRED
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_NOCOLRED                                    0x00000040
#define FLASH_FBSTROBES_NOCOLRED_BITN                                        6
#define FLASH_FBSTROBES_NOCOLRED_M                                  0x00000040
#define FLASH_FBSTROBES_NOCOLRED_S                                           6

// Field:     [5] PRECOL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_PRECOL                                      0x00000020
#define FLASH_FBSTROBES_PRECOL_BITN                                          5
#define FLASH_FBSTROBES_PRECOL_M                                    0x00000020
#define FLASH_FBSTROBES_PRECOL_S                                             5

// Field:     [4] TI_OTP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_TI_OTP                                      0x00000010
#define FLASH_FBSTROBES_TI_OTP_BITN                                          4
#define FLASH_FBSTROBES_TI_OTP_M                                    0x00000010
#define FLASH_FBSTROBES_TI_OTP_S                                             4

// Field:     [3] OTP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_OTP                                         0x00000008
#define FLASH_FBSTROBES_OTP_BITN                                             3
#define FLASH_FBSTROBES_OTP_M                                       0x00000008
#define FLASH_FBSTROBES_OTP_S                                                3

// Field:     [2] TEZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBSTROBES_TEZ                                         0x00000004
#define FLASH_FBSTROBES_TEZ_BITN                                             2
#define FLASH_FBSTROBES_TEZ_M                                       0x00000004
#define FLASH_FBSTROBES_TEZ_S                                                2

//*****************************************************************************
//
// Register: FLASH_O_FPSTROBES
//
//*****************************************************************************
// Field:     [8] EXECUTEZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPSTROBES_EXECUTEZ                                    0x00000100
#define FLASH_FPSTROBES_EXECUTEZ_BITN                                        8
#define FLASH_FPSTROBES_EXECUTEZ_M                                  0x00000100
#define FLASH_FPSTROBES_EXECUTEZ_S                                           8

// Field:     [1] V3PWRDNZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPSTROBES_V3PWRDNZ                                    0x00000002
#define FLASH_FPSTROBES_V3PWRDNZ_BITN                                        1
#define FLASH_FPSTROBES_V3PWRDNZ_M                                  0x00000002
#define FLASH_FPSTROBES_V3PWRDNZ_S                                           1

// Field:     [0] V5PWRDNZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FPSTROBES_V5PWRDNZ                                    0x00000001
#define FLASH_FPSTROBES_V5PWRDNZ_BITN                                        0
#define FLASH_FPSTROBES_V5PWRDNZ_M                                  0x00000001
#define FLASH_FPSTROBES_V5PWRDNZ_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FBMODE
//
//*****************************************************************************
// Field:   [2:0] MODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FBMODE_MODE_W                                                  3
#define FLASH_FBMODE_MODE_M                                         0x00000007
#define FLASH_FBMODE_MODE_S                                                  0

//*****************************************************************************
//
// Register: FLASH_O_FTCR
//
//*****************************************************************************
// Field:   [6:0] TCR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FTCR_TCR_W                                                     7
#define FLASH_FTCR_TCR_M                                            0x0000007F
#define FLASH_FTCR_TCR_S                                                     0

//*****************************************************************************
//
// Register: FLASH_O_FADDR
//
//*****************************************************************************
// Field:  [31:0] FADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FADDR_FADDR_W                                                 32
#define FLASH_FADDR_FADDR_M                                         0xFFFFFFFF
#define FLASH_FADDR_FADDR_S                                                  0

//*****************************************************************************
//
// Register: FLASH_O_FTCTL
//
//*****************************************************************************
// Field:    [16] WDATA_BLK_CLR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FTCTL_WDATA_BLK_CLR                                   0x00010000
#define FLASH_FTCTL_WDATA_BLK_CLR_BITN                                      16
#define FLASH_FTCTL_WDATA_BLK_CLR_M                                 0x00010000
#define FLASH_FTCTL_WDATA_BLK_CLR_S                                         16

