RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc13x0/inc/hw_flash.h
// Field:    [21] ALL_BANKS
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_ALL_BANKS                              0x00200000
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_BITN                                 21
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_M                            0x00200000
#define FLASH_FSM_ST_MACHINE_ALL_BANKS_S                                    21

// Field:    [20] CMPV_ALLOWED
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED                           0x00100000
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_BITN                              20
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_M                         0x00100000
#define FLASH_FSM_ST_MACHINE_CMPV_ALLOWED_S                                 20

// Field:    [19] RANDOM
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RANDOM                                 0x00080000
#define FLASH_FSM_ST_MACHINE_RANDOM_BITN                                    19
#define FLASH_FSM_ST_MACHINE_RANDOM_M                               0x00080000
#define FLASH_FSM_ST_MACHINE_RANDOM_S                                       19

// Field:    [18] RV_SEC_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN                              0x00040000
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_BITN                                 18
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_M                            0x00040000
#define FLASH_FSM_ST_MACHINE_RV_SEC_EN_S                                    18

// Field:    [17] RV_RES
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_RES                                 0x00020000
#define FLASH_FSM_ST_MACHINE_RV_RES_BITN                                    17
#define FLASH_FSM_ST_MACHINE_RV_RES_M                               0x00020000
#define FLASH_FSM_ST_MACHINE_RV_RES_S                                       17

// Field:    [16] RV_INT_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_RV_INT_EN                              0x00010000
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_BITN                                 16
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_M                            0x00010000
#define FLASH_FSM_ST_MACHINE_RV_INT_EN_S                                    16

// Field:    [14] ONE_TIME_GOOD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD                          0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_BITN                             14
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_M                        0x00004000
#define FLASH_FSM_ST_MACHINE_ONE_TIME_GOOD_S                                14

// Field:    [11] DO_REDU_COL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL                            0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_BITN                               11
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_M                          0x00000800
#define FLASH_FSM_ST_MACHINE_DO_REDU_COL_S                                  11

// Field:  [10:7] DBG_SHORT_ROW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_W                                 4
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_M                        0x00000780
#define FLASH_FSM_ST_MACHINE_DBG_SHORT_ROW_S                                 7

// Field:     [5] PGM_SEC_COF_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN                         0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_BITN                             5
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_M                       0x00000020
#define FLASH_FSM_ST_MACHINE_PGM_SEC_COF_EN_S                                5

// Field:     [4] PREC_STOP_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN                           0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_BITN                               4
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_M                         0x00000010
#define FLASH_FSM_ST_MACHINE_PREC_STOP_EN_S                                  4

// Field:     [3] DIS_TST_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN                             0x00000008
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_BITN                                 3
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_M                           0x00000008
#define FLASH_FSM_ST_MACHINE_DIS_TST_EN_S                                    3

// Field:     [2] CMD_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_CMD_EN                                 0x00000004
#define FLASH_FSM_ST_MACHINE_CMD_EN_BITN                                     2
#define FLASH_FSM_ST_MACHINE_CMD_EN_M                               0x00000004
#define FLASH_FSM_ST_MACHINE_CMD_EN_S                                        2

// Field:     [1] INV_DATA
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_INV_DATA                               0x00000002
#define FLASH_FSM_ST_MACHINE_INV_DATA_BITN                                   1
#define FLASH_FSM_ST_MACHINE_INV_DATA_M                             0x00000002
#define FLASH_FSM_ST_MACHINE_INV_DATA_S                                      1

// Field:     [0] OVERRIDE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ST_MACHINE_OVERRIDE                               0x00000001
#define FLASH_FSM_ST_MACHINE_OVERRIDE_BITN                                   0
#define FLASH_FSM_ST_MACHINE_OVERRIDE_M                             0x00000001
#define FLASH_FSM_ST_MACHINE_OVERRIDE_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_FLES
//
//*****************************************************************************
// Field:  [11:8] BLK_TIOTP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_FLES_BLK_TIOTP_W                                           4
#define FLASH_FSM_FLES_BLK_TIOTP_M                                  0x00000F00
#define FLASH_FSM_FLES_BLK_TIOTP_S                                           8

// Field:   [7:0] BLK_OTP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_FLES_BLK_OTP_W                                             8
#define FLASH_FSM_FLES_BLK_OTP_M                                    0x000000FF
#define FLASH_FSM_FLES_BLK_OTP_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_WR_ENA
//
//*****************************************************************************
// Field:   [2:0] WR_ENA
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_WR_ENA_WR_ENA_W                                            3
#define FLASH_FSM_WR_ENA_WR_ENA_M                                   0x00000007
#define FLASH_FSM_WR_ENA_WR_ENA_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ACC_PP
//
//*****************************************************************************
// Field:  [31:0] FSM_ACC_PP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ACC_PP_FSM_ACC_PP_W                                       32
#define FLASH_FSM_ACC_PP_FSM_ACC_PP_M                               0xFFFFFFFF
#define FLASH_FSM_ACC_PP_FSM_ACC_PP_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ACC_EP
//
//*****************************************************************************
// Field:  [15:0] ACC_EP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ACC_EP_ACC_EP_W                                           16
#define FLASH_FSM_ACC_EP_ACC_EP_M                                   0x0000FFFF
#define FLASH_FSM_ACC_EP_ACC_EP_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ADDR
//
//*****************************************************************************
// Field: [30:28] BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ADDR_BANK_W                                                3
#define FLASH_FSM_ADDR_BANK_M                                       0x70000000
#define FLASH_FSM_ADDR_BANK_S                                               28

// Field:  [27:0] CUR_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ADDR_CUR_ADDR_W                                           28
#define FLASH_FSM_ADDR_CUR_ADDR_M                                   0x0FFFFFFF
#define FLASH_FSM_ADDR_CUR_ADDR_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SECTOR
//
//*****************************************************************************
// Field: [31:16] SECT_ERASED
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR_SECT_ERASED_W                                      16
#define FLASH_FSM_SECTOR_SECT_ERASED_M                              0xFFFF0000
#define FLASH_FSM_SECTOR_SECT_ERASED_S                                      16

// Field:  [15:8] FSM_SECTOR_EXTENSION
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR_FSM_SECTOR_EXTENSION_W                              8
#define FLASH_FSM_SECTOR_FSM_SECTOR_EXTENSION_M                     0x0000FF00
#define FLASH_FSM_SECTOR_FSM_SECTOR_EXTENSION_S                              8

// Field:   [7:4] SECTOR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR_SECTOR_W                                            4
#define FLASH_FSM_SECTOR_SECTOR_M                                   0x000000F0
#define FLASH_FSM_SECTOR_SECTOR_S                                            4

// Field:   [3:0] SEC_OUT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR_SEC_OUT_W                                           4
#define FLASH_FSM_SECTOR_SEC_OUT_M                                  0x0000000F
#define FLASH_FSM_SECTOR_SEC_OUT_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FMC_REV_ID
//
//*****************************************************************************
// Field: [31:12] MOD_VERSION
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMC_REV_ID_MOD_VERSION_W                                      20
#define FLASH_FMC_REV_ID_MOD_VERSION_M                              0xFFFFF000
#define FLASH_FMC_REV_ID_MOD_VERSION_S                                      12

// Field:  [11:0] CONFIG_CRC
//
// Internal. Only to be used through TI provided API.
#define FLASH_FMC_REV_ID_CONFIG_CRC_W                                       12
#define FLASH_FMC_REV_ID_CONFIG_CRC_M                               0x00000FFF
#define FLASH_FMC_REV_ID_CONFIG_CRC_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERR_ADDR
//
//*****************************************************************************
// Field:  [31:8] FSM_ERR_ADDR
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERR_ADDR_FSM_ERR_ADDR_W                                   24
#define FLASH_FSM_ERR_ADDR_FSM_ERR_ADDR_M                           0xFFFFFF00
#define FLASH_FSM_ERR_ADDR_FSM_ERR_ADDR_S                                    8

// Field:   [3:0] FSM_ERR_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERR_ADDR_FSM_ERR_BANK_W                                    4
#define FLASH_FSM_ERR_ADDR_FSM_ERR_BANK_M                           0x0000000F
#define FLASH_FSM_ERR_ADDR_FSM_ERR_BANK_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PGM_MAXPUL
//
//*****************************************************************************
// Field:  [11:0] FSM_PGM_MAXPUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PGM_MAXPUL_FSM_PGM_MAXPUL_W                               12
#define FLASH_FSM_PGM_MAXPUL_FSM_PGM_MAXPUL_M                       0x00000FFF
#define FLASH_FSM_PGM_MAXPUL_FSM_PGM_MAXPUL_S                                0

//*****************************************************************************
//
// Register: FLASH_O_FSM_EXECUTE
//
//*****************************************************************************
// Field: [19:16] SUSPEND_NOW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EXECUTE_SUSPEND_NOW_W                                      4
#define FLASH_FSM_EXECUTE_SUSPEND_NOW_M                             0x000F0000
#define FLASH_FSM_EXECUTE_SUSPEND_NOW_S                                     16

// Field:   [4:0] FSMEXECUTE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EXECUTE_FSMEXECUTE_W                                       5
#define FLASH_FSM_EXECUTE_FSMEXECUTE_M                              0x0000001F
#define FLASH_FSM_EXECUTE_FSMEXECUTE_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SECTOR1
//
//*****************************************************************************
// Field:  [31:0] FSM_SECTOR1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR1_FSM_SECTOR1_W                                     32
#define FLASH_FSM_SECTOR1_FSM_SECTOR1_M                             0xFFFFFFFF
#define FLASH_FSM_SECTOR1_FSM_SECTOR1_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SECTOR2
//
//*****************************************************************************
// Field:  [31:0] FSM_SECTOR2
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SECTOR2_FSM_SECTOR2_W                                     32
#define FLASH_FSM_SECTOR2_FSM_SECTOR2_M                             0xFFFFFFFF
#define FLASH_FSM_SECTOR2_FSM_SECTOR2_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLE0
//
//*****************************************************************************
// Field:  [31:0] FSM_BSLE0
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_BSLE0_FSM_BSLE0_W                                         32
#define FLASH_FSM_BSLE0_FSM_BSLE0_M                                 0xFFFFFFFF
#define FLASH_FSM_BSLE0_FSM_BSLE0_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLE1
//
//*****************************************************************************
// Field:  [31:0] FSM_BSL1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_BSLE1_FSM_BSL1_W                                          32
#define FLASH_FSM_BSLE1_FSM_BSL1_M                                  0xFFFFFFFF
#define FLASH_FSM_BSLE1_FSM_BSL1_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLP0
//
//*****************************************************************************
// Field:  [31:0] FSM_BSLP0
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_BSLP0_FSM_BSLP0_W                                         32
#define FLASH_FSM_BSLP0_FSM_BSLP0_M                                 0xFFFFFFFF
#define FLASH_FSM_BSLP0_FSM_BSLP0_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_BSLP1
//
//*****************************************************************************
// Field:  [31:0] FSM_BSL1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_BSLP1_FSM_BSL1_W                                          32
#define FLASH_FSM_BSLP1_FSM_BSL1_M                                  0xFFFFFFFF
#define FLASH_FSM_BSLP1_FSM_BSL1_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_BANK
//
//*****************************************************************************
// Field: [31:20] EE_BANK_WIDTH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BANK_EE_BANK_WIDTH_W                                     12
#define FLASH_FCFG_BANK_EE_BANK_WIDTH_M                             0xFFF00000
#define FLASH_FCFG_BANK_EE_BANK_WIDTH_S                                     20

// Field: [19:16] EE_NUM_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BANK_EE_NUM_BANK_W                                        4
#define FLASH_FCFG_BANK_EE_NUM_BANK_M                               0x000F0000
#define FLASH_FCFG_BANK_EE_NUM_BANK_S                                       16

// Field:  [15:4] MAIN_BANK_WIDTH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BANK_MAIN_BANK_WIDTH_W                                   12
#define FLASH_FCFG_BANK_MAIN_BANK_WIDTH_M                           0x0000FFF0
#define FLASH_FCFG_BANK_MAIN_BANK_WIDTH_S                                    4

// Field:   [3:0] MAIN_NUM_BANK
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_BANK_MAIN_NUM_BANK_W                                      4
#define FLASH_FCFG_BANK_MAIN_NUM_BANK_M                             0x0000000F
#define FLASH_FCFG_BANK_MAIN_NUM_BANK_S                                      0

//*****************************************************************************
//
// Register: FLASH_O_FCFG_WRAPPER
//
//*****************************************************************************
// Field: [31:24] FAMILY_TYPE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_FAMILY_TYPE_W                                     8
#define FLASH_FCFG_WRAPPER_FAMILY_TYPE_M                            0xFF000000
#define FLASH_FCFG_WRAPPER_FAMILY_TYPE_S                                    24

// Field:    [20] MEM_MAP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_MEM_MAP                                  0x00100000
#define FLASH_FCFG_WRAPPER_MEM_MAP_BITN                                     20
#define FLASH_FCFG_WRAPPER_MEM_MAP_M                                0x00100000
#define FLASH_FCFG_WRAPPER_MEM_MAP_S                                        20

// Field: [19:16] CPU2
//
// Internal. Only to be used through TI provided API.
#define FLASH_FCFG_WRAPPER_CPU2_W                                            4
#define FLASH_FCFG_WRAPPER_CPU2_M                                   0x000F0000
#define FLASH_FCFG_WRAPPER_CPU2_S                                           16

